cases/T1_pitzDaily/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  coupledFoam test case T1 - pitzDaily
  Identical schemes for coupledFoam and the simpleFoam reference (spec 14):
  linearUpwind grad(U), Gauss linear corrected.
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         none;

    div(phi,U)          bounded Gauss linearUpwind grad(U);
    div(phi,U)_upwind   bounded Gauss upwind;

    turbulence      bounded Gauss limitedLinear 1;
    div(phi,k)      $turbulence;
    div(phi,omega)  $turbulence;

    div((nuEff*dev2(T(grad(U)))))   Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

wallDist
{
    method          meshWave;
}

// ************************************************************************* //
